package d250609.ch5;

public class Inheritance_Ex1 {
    // 상속, 기본개념
    // 부모클래스와 자식클래스의 관계
    // 필드, 메소드 상속 및 오버라이딩(새기능으로 고쳐쓰기)
    // super ? 부모를 가리키는 키워드
    // this ? 자기 자신의 인스턴스를 가리키는 키워드
    // protected 이용한 접근방법 확인

    // 상속 을 왜 하나요?? 객체지향 프로그래밍 기법에서 재사용하기 위해
    
    // 상속은 Is A 관계임.
    // 무조건 상속이 되는건 아님! 포함관계가 성립을 해야 상속이 가능함.

    // public class 자식클래스명 extends 부모클래스명 {}
    // 부모클래스 : Animal ... 자식클래스 : Dog

    // 개는 동물이다 ==> Dog is Animal (성립)
    // 전기차는 자동차이다 ==> (성립)
    
    // 상속시에 부모의 초기화가 먼저 되야함. 중요!!!!!!!
}
